app/Http/Controllers/API/AuthController.php

    public function login(Request $request)
    {

        $request->validate(['email' => 'required|email']);
        try {
            $user = User::where('email', $request->email)->first();

            $tokens = $user->tokens()
                ->with('client')
                ->where('revoked', false)
                ->where('expires_at', '>', Date::now())
                ->get()
                ->filter(fn(Token $token) => $token->client->hasGrantType('personal_access'));
---
select * from "users" where "email" = 'test3@mail.ru' limit 1