routes/web.php


Route::get('/', [HomeController::class, 'index'])->name('home.index');

Route::get('/carousel', function () {
    $sliders = Slider::where('isActive', true)
        ->latest('created_at')
        ->get();

    return view('layout.carousel', compact('sliders'));
});
---
select * from "sliders" order by "created_at" desc