app/Http/Controllers/HomeController.php

    public function index()
    {
        $sliders = Slider::where('isActive', true)->latest('created_at')->get();
        $categories = ItemCategory::with('items')->latest('created_at')->get();
---
select * from "sliders" where "isActive" = 1 order by "created_at" desc
select * from "item_categories" order by "created_at" desc