app/Http/Controllers/RegisterController.php

insert into "users" ("name", "email", "department", "tel", "password", "updated_at", "created_at") values ('Тест 2', 'test2@mail.ru', 'Другой', '89116972434', '$2y$12$ti4cdOpb.PFz5h0VHQ6mdeVJAE3nApEFpC5MDpJR/vmzGcb1Nk90K', '2025-12-22 11:23:14', '2025-12-22 11:23:14') returning "id"
---
    public function verifyUser($id)
    {
        $req = RegisterRequest::findOrFail($id);

        Log::error('error', [$req]);

        if (is_null($req['isVerified']) && !$req['pending_verification']) {

            $req['pending_verification'] = true;
            $req->update();
//            $userPassword = Str::random(8);
            $this->createUser($req);