app/Http/Controllers/RegisterController.php

select * from "register_requests" where "isVerified" is null order by "id" asc
---
    public function index()
    {
        $content = RegisterRequest::where('isVerified', null)->orderBy('id', 'asc')->get();

insert into "register_requests" ("name", "message", "tel", "password", "department", "email", "updated_at", "created_at") values ('Тест 3', 'fsdfasfadfasd', '89116972434', '$2y$12$t.K2NP6/.HZIKw/U75PRt.9EfIj76rtONM89ggoqmYklpB/hcl6N.', 'Маркетинг', 'test3@mail.ru', '2025-12-24 09:14:52', '2025-12-24 09:14:52') returning "id"
---
    public function store(RegisterRequestRequest $request)
    {
//        dd($request);
//        $request->validate([
//            'name' => ['required', 'string', 'max:255'],
//            'email' => ['required', 'string', 'lowercase', 'email', 'max:255', 'unique:'.User::class],
//            'password' => ['required', 'confirmed', Rules\Password::defaults()],
//            'tel' => ['required', 'string', 'size:11'],
//        ]);

        $reg = new RegisterRequest();
        $reg->name = $request['name'];
        $reg->message = $request['message'];
        $reg->tel = $request['tel'];
//        $reg->password = $request['password'];
        $reg->department = $request['department'];
        $reg->email = $request['email'];

        $reg->save();

select * from "register_requests" where "register_requests"."id" = '4' limit 1
update "register_requests" set "isVerified" = 1, "updated_at" = '2025-12-24 09:16:20' where "id" = 4
insert into "users" ("name", "email", "password", "tel", "department", "updated_at", "created_at") values ('Тест 3', 'test3@mail.ru', '$2y$12$t.K2NP6/.HZIKw/U75PRt.9EfIj76rtONM89ggoqmYklpB/hcl6N.', '89116972434', 'Маркетинг', '2025-12-24 09:16:20', '2025-12-24 09:16:20') returning "id"
---
    public function verifyUser($id)
    {
        $req = RegisterRequest::findOrFail($id);
        Log::error('error', [$req]);
        if (is_null($req['isVerified'])) {
//            dd(is_null($req['isVerified']));
            $req['isVerified'] = true;
            $req->update();

//            $user = User::create([
//                'name' => $req->name,
//                'email' => $req->email,
//                'password' => Str::random(8),
//                'tel' => $req->tel,
//                'department' => $req->department,
//            ]);

            $user = $this->createUser($req);