app/Http/Controllers/UserController.php

select * from "register_requests" where "isVerified" = 0 order by "created_at" desc
---
    public function index()
    {
        $content = RegisterRequest::latest()->where('isVerified', null)->get();